Autodesk.Navisworks.Api.Plugins.RibbonTabAttribute
Defines a ribbon tab in the GUI system.

Autodesk.Navisworks.Api.Plugins.RibbonTabAttribute.#ctor(System.String)
Constructor
name:
The name of the Ribbon tab

Autodesk.Navisworks.Api.Plugins.RibbonTabAttribute.CallCanExecute
Determines the conditions in which CanExecuteRibbonTab should be called.

Autodesk.Navisworks.Api.Plugins.RibbonTabAttribute.DisplayName
The text to display for this Ribbon tab

Autodesk.Navisworks.Api.Plugins.RibbonTabAttribute.LoadForCanExecute
Specifies if CanExecuteRibbonTab should cause the Plugin to load

Autodesk.Navisworks.Api.Plugins.RibbonTabAttribute.Name
The name of the Ribbon tab